Есть два родительских класса:
-Люди
    Свойства:
        -Пол, возраст, имя и тд
-Курсы
    Свойства:
        
        -Учебники
        -Учитель


У людей есть два подкласса:
-Учителя
    Свойства:
        -Один предмет
        -Группы у которых есть этот предмет
    Объекты:
        -Учитель
    Методы:
        -Формат обучения
        -Проверка дз
        -Выставление оценок

-Ученики
    Свойства:
        -Предметы
        -Номер группы

    Объекты:
        -Ученик

    Методы:
        -ходить на учебу
        -делать дз

У курсов подклассы это предметы:
-Математика
    Свойства:
        -Успеваемость
        -Учителя (у них уже есть группы)
        -Определенные учебники
    Объекты:
        -Курс
